#+TITLE: The Unit Type
#+NAME: Unit
#+AUTHOR: Johann Rosain

* Unit

  #+begin_src ctt
  module Lib.Data.Unit where
  #+end_src

This file defines the unit type, i.e., the type that is inhabited by a unique element (often named =star=). As it is an inductive type, it also comes equiped with an induction principle.

** Definition

   #+begin_src ctt
  data Unit : U = star
   #+end_src

** Induction principle

   #+begin_src ctt
  ind-Unit (P : Unit -> U) (p : P star) : (x : Unit) -> P x = split
    star -> p
   #+end_src

#+RESULTS:
: Typecheck has succeeded.
